In [1]:
import pandas as pd
import re
import os

In [2]:
# !pip install pandas xlrd

In [3]:
os.listdir()

['.ipynb_checkpoints',
 'dashboard.py',
 'Jumbo & Company_ Attach % .xls',
 'Jumbo_Company_Analysis.csv',
 'Untitled.ipynb']

In [6]:
for i in os.listdir():
    if re.search("xls", i.lower()):
        print(i)
        df = pd.read_excel(i, engine="xlrd")

Jumbo & Company_ Attach % .xls

In [13]:
df.head()

      Branch               Store_Name   Dec   Nov   Oct   Sep   Aug
0  Delhi_Ncr      Delhi(Janakpuri) Br  0.23  0.17  0.16  0.25  0.24
1  Delhi_Ncr      Haryana(Gurgaon) Br  0.21  0.26  0.15  0.28  0.04
2  Delhi_Ncr     Up(Greater Noida) Br  0.25  0.36  0.30  0.41  0.43
3       Pune         Pune(Bhosari) Br  0.33  0.33  0.36  0.13  0.32
4    Gujarat  Ahmedabad(Maninagar) Br  0.19  0.11  0.14  0.21  0.17

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 163 entries, 0 to 162
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Branch      163 non-null    object
 1   Store_Name  163 non-null    object
 2   Dec         163 non-null    float64
 3   Nov         163 non-null    float64
 4   Oct         163 non-null    float64
 5   Sep         163 non-null    float64
 6   Aug         163 non-null    float64
dtypes: float64(5), object(2)
memory usage: 9.0+ KB

In [17]:
df["Branch"].value_counts()

Delhi_Ncr    44
Telangana    40
Gujarat      24
Thane        20
Mumbai       19
Pune         16
Name: Branch, dtype: int64

In [7]:
# Convert percentages to float
months = ['Dec', 'Nov', 'Oct', 'Sep', 'Aug']
df[months] = df[months].astype(float)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 163 entries, 0 to 162
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Branch      163 non-null    object
 1   Store_Name  163 non-null    object
 2   Dec         163 non-null    float64
 3   Nov         163 non-null    float64
 4   Oct         163 non-null    float64
 5   Sep         163 non-null    float64
 6   Aug         163 non-null    float64
dtypes: float64(5), object(2)
memory usage: 9.0+ KB

In [10]:
df[months].mean(axis=1)

0      0.210
1      0.188
2      0.350
3      0.294
4      0.164
       ...
158    0.106
159    0.000
160    0.000
161    0.000
162    0.000
Length: 163, dtype: float64

In [9]:
# Add Avg_5M and change from Nov to Dec
df['Avg_5M'] = df[months].mean(axis=1)
df['Change_Nov_to_Dec'] = df['Dec'] - df['Nov']
df.head()

,Branch,Store_Name,Dec,Nov,Oct,Sep,Aug,Avg_5M,Change_Nov_to_Dec
0,Delhi_Ncr,Delhi(Janakpuri) Br,0.23,0.17,0.16,0.25,0.24,0.210,0.06
1,Delhi_Ncr,Haryana(Gurgaon) Br,0.21,0.26,0.15,0.28,0.04,0.188,-0.05
2,Delhi_Ncr,Up(Greater Noida) Br,0.25,0.36,0.30,0.41,0.43,0.350,-0.11
3,Pune,Pune(Bhosari) Br,0.33,0.33,0.36,0.13,0.32,0.294,0.00
4,Gujarat,Ahmedabad(Maninagar) Br,0.19,0.11,0.14,0.21,0.17,0.164,0.08

In [11]:
monthly_avg = df[months].mean().round(3)
monthly_df = pd.DataFrame({
    'Month': ['Aug', 'Sep', 'Oct', 'Nov', 'Dec'], 
    'Avg_Performance': monthly_avg.values * 100  # Convert to %
})

In [12]:
monthly_avg

Dec    0.217
Nov    0.217
Oct    0.171
Sep    0.167
Aug    0.129
dtype: float64

In [13]:
monthly_df

  Month  Avg_Performance
0   Aug             21.7
1   Sep             21.7
2   Oct             17.1
3   Nov             16.7
4   Dec             12.9

In [16]:
branch_perf = df.groupby('Branch')[months].mean().round(3)
branch_perf['Avg_5M'] = branch_perf.mean(axis=1).round(3)
branch_perf = branch_perf.sort_values('Avg_5M', ascending=False)
branch_perf

             Dec    Nov    Oct    Sep    Aug  Avg_5M
Branch
Pune       0.288  0.355  0.291  0.243  0.205   0.276
Delhi_Ncr  0.283  0.280  0.235  0.228  0.191   0.243
Mumbai     0.183  0.215  0.171  0.185  0.114   0.174
Thane      0.152  0.160  0.153  0.174  0.104   0.149
Gujarat    0.191  0.128  0.129  0.131  0.093   0.134
Telangana  0.181  0.175  0.086  0.080  0.070   0.118

In [17]:
branch_df

      Branch  Avg_5M
0       Pune    27.6
1  Delhi_Ncr    24.3
2     Mumbai    17.4
3      Thane    14.9
4    Gujarat    13.4
5  Telangana    11.8

In [18]:
top_10 = df[['Store_Name', 'Branch', 'Avg_5M']].sort_values('Avg_5M', ascending=False).head(10).copy()
top_10['Avg_5M'] = top_10['Avg_5M'] * 100
top_10

              Store_Name     Branch  Avg_5M
10      Delhi(Hauz Khas)  Delhi_Ncr    62.2
69        Pune(Hadapsar)       Pune    58.6
64        Pune(Kondhawa)       Pune    41.4
81     Delhi(Budh Vihar)  Delhi_Ncr    39.0
17      Delhi(Daryaganj)  Delhi_Ncr    38.6
29     Pune(Dange Chowk)       Pune    36.8
7            Bhiwandi Br      Thane    36.2
91         Delhi(Narela)  Delhi_Ncr    35.8
21  Haryana(Mewla M.) Br  Delhi_Ncr    35.2
2   Up(Greater Noida) Br  Delhi_Ncr    35.0

In [19]:
bottom_10 = df[['Store_Name', 'Branch', 'Avg_5M']].sort_values('Avg_5M', ascending=True).head(10).copy()
bottom_10['Avg_5M'] = bottom_10['Avg_5M'] * 100
bottom_10

                           Store_Name     Branch  Avg_5M
162              Vadodara(Kothi Road)    Gujarat     0.0
160  Ap(Tirupathi-Leela Mahal Circle)  Telangana     0.0
159                       Kharghar Br      Thane     0.0
85                        Currey Road      Thane     0.0
161                    Ap(Rajamundry)  Telangana     0.0
33                     MAHIM(VS Next)     Mumbai     0.0
155                    Ap(Ntr Circle)  Telangana     0.0
153                         Boisar Br     Mumbai     2.0
151                     Ulhasnagar Br      Thane     2.2
154                         Ap(Vizag)  Telangana     3.4